## PROJECT V : TAXIS IN NYC ANALYSIS 

In this project data obtaind for NYC taxis in february 2019 is going to be analyzed. A weather databased is going to be related in ordert to see the effect of weather conditions on several parameters such as number of trips, duration or average distance.

In [1]:
import pandas as pd
from src import cleaning as cl

In [2]:
pd.set_option('display.max_columns', None)

In [3]:
taxi = pd.read_csv("starting data/taxi.csv")
weather = pd.read_csv("starting data/nyc_temperature.csv")

#### STEP 1 : basic information of the datasets

In [4]:
taxi.sample()

,Unnamed: 0,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
748,748,2019-03-03 22:59:34,2019-03-03 23:00:39,2,0.44,3.5,1.46,0.0,8.76,yellow,credit card,Midtown South,Union Sq,Manhattan,Manhattan

In [5]:
weather.sample()

,date,tmax,tmin,tavg,departure,HDD,CDD,precipitation,new_snow,snow_depth
248,6/9/19,69,60,64.5,-9.5,0,0,0.03,0,0

In [6]:
taxi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       6433 non-null   int64
 1   pickup           6433 non-null   object
 2   dropoff          6433 non-null   object
 3   passengers       6433 non-null   int64
 4   distance         6433 non-null   float64
 5   fare             6433 non-null   float64
 6   tip              6433 non-null   float64
 7   tolls            6433 non-null   float64
 8   total            6433 non-null   float64
 9   color            6433 non-null   object
 10  payment          6389 non-null   object
 11  pickup_zone      6407 non-null   object
 12  dropoff_zone     6388 non-null   object
 13  pickup_borough   6407 non-null   object
 14  dropoff_borough  6388 non-null   object
dtypes: float64(5), int64(2), object(8)
memory usage: 754.0+ KB

In [7]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           365 non-null    object
 1   tmax           365 non-null    int64
 2   tmin           365 non-null    int64
 3   tavg           365 non-null    float64
 4   departure      365 non-null    float64
 5   HDD            365 non-null    int64
 6   CDD            365 non-null    int64
 7   precipitation  365 non-null    object
 8   new_snow       365 non-null    object
 9   snow_depth     365 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 28.6+ KB

In [8]:
taxi.describe()

,Unnamed: 0,passengers,distance,fare,tip,tolls,total
count,6433.000000,6433.000000,6433.000000,6433.000000,6433.00000,6433.000000,6433.000000
mean,3216.000000,1.539251,3.024617,13.091073,1.97922,0.325273,18.517794
std,1857.191473,1.203768,3.827867,11.551804,2.44856,1.415267,13.815570
min,0.000000,0.000000,0.000000,1.000000,0.00000,0.000000,1.300000
25%,1608.000000,1.000000,0.980000,6.500000,0.00000,0.000000,10.800000
50%,3216.000000,1.000000,1.640000,9.500000,1.70000,0.000000,14.160000
75%,4824.000000,2.000000,3.210000,15.000000,2.80000,0.000000,20.300000
max,6432.000000,6.000000,36.700000,150.000000,33.20000,24.020000,174.820000

In [9]:
weather.describe()

             tmax        tmin        tavg   departure         HDD         CDD
count  365.000000  365.000000  365.000000  365.000000  365.000000  365.000000
mean    63.169863   49.512329   56.341096   -0.527945   12.463014    4.065753
std     18.806232   17.154853   17.821404    6.421460   13.264920    6.374835
min     16.000000    3.000000   10.000000  -24.100000    0.000000    0.000000
25%     47.000000   35.000000   41.000000   -4.700000    0.000000    0.000000
50%     63.000000   49.000000   56.000000    0.100000    9.000000    0.000000
75%     79.000000   65.000000   72.000000    3.700000   24.000000    7.000000
max    100.000000   83.000000   91.500000   17.400000   55.000000   27.000000

In [10]:
taxi.isna().sum()

Unnamed: 0          0
pickup              0
dropoff             0
passengers          0
distance            0
fare                0
tip                 0
tolls               0
total               0
color               0
payment            44
pickup_zone        26
dropoff_zone       45
pickup_borough     26
dropoff_borough    45
dtype: int64

In [11]:
weather.isna().sum()

date             0
tmax             0
tmin             0
tavg             0
departure        0
HDD              0
CDD              0
precipitation    0
new_snow         0
snow_depth       0
dtype: int64

#### STEP 2 : cleaning and transforming datasets

In [12]:
taxi = cl.get_date_week_duration(taxi,'pickup', 'dropoff')

In [13]:
weather = cl.df_to_celsius_and_num_values (weather)

In [14]:
taxi.sample()

,Unnamed: 0,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,date,year,month,day,hour,week_day,duration
3717,3717,2019-03-07 08:19:06,2019-03-07 08:22:49,1,0.88,5.0,1.24,0.0,9.54,yellow,credit card,Kips Bay,Sutton Place/Turtle Bay North,Manhattan,Manhattan,2019-03-07,2019,3,7,8,Thursday,3.72

In [15]:
weather.sample()

,date,tmax,tmin,tavg,departure,HDD,CDD,precipitation,new_snow,snow_depth,tmax_c,tmin_c,tavg_c,departure_c
44,2019-02-14,46,33,39.5,3.4,25,0,0,0,0,7.78,0.56,4.17,-15.89

#### STEP 3 : exporting the new datasets to a folder to be used in SQL and Tableu

In [16]:
taxi.to_csv('data/taxi.csv')

In [17]:
weather.to_csv('data/weather.csv')